Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m3_ek/http_server_demo/iar/startup_ra6m3.c
//Dependencies
#include "bsp_api.h"

//Forward function declaration
void SystemInit(void);
void __iar_program_start(void);
int __low_level_init(void);

//Default handler
void Default_Handler(void);

//Cortex-M4 core handlers
void Reset_Handler(void);
void NMI_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);
void SVC_Handler(void);
void DebugMon_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);

#pragma weak NMI_Handler = Default_Handler
#pragma weak HardFault_Handler = Default_Handler
#pragma weak MemManage_Handler = Default_Handler
#pragma weak BusFault_Handler = Default_Handler
#pragma weak UsageFault_Handler = Default_Handler
#pragma weak SVC_Handler = Default_Handler
#pragma weak DebugMon_Handler = Default_Handler
#pragma weak PendSV_Handler = Default_Handler
#pragma weak SysTick_Handler = Default_Handler

//Peripherals handlers
void ICU_IRQ0_IRQHandler(void);
void ICU_IRQ1_IRQHandler(void);
void ICU_IRQ2_IRQHandler(void);
void ICU_IRQ3_IRQHandler(void);
void ICU_IRQ4_IRQHandler(void);
void ICU_IRQ5_IRQHandler(void);
void ICU_IRQ6_IRQHandler(void);
void ICU_IRQ7_IRQHandler(void);
void ICU_IRQ8_IRQHandler(void);
void ICU_IRQ9_IRQHandler(void);
void ICU_IRQ10_IRQHandler(void);
void ICU_IRQ11_IRQHandler(void);
void ICU_IRQ12_IRQHandler(void);
void ICU_IRQ13_IRQHandler(void);
void ICU_IRQ14_IRQHandler(void);
void ICU_IRQ15_IRQHandler(void);
void DMAC0_INT_IRQHandler(void);
void DMAC1_INT_IRQHandler(void);
void DMAC2_INT_IRQHandler(void);
void DMAC3_INT_IRQHandler(void);
void DMAC4_INT_IRQHandler(void);
void DMAC5_INT_IRQHandler(void);
void DMAC6_INT_IRQHandler(void);
void DMAC7_INT_IRQHandler(void);
void DTC_COMPLETE_IRQHandler(void);
void DTC_END_IRQHandler(void);
void ICU_SNOOZE_CANCEL_IRQHandler(void);
void FCU_FIFERR_IRQHandler(void);
void FCU_FRDYI_IRQHandler(void);
void LVD_LVD1_IRQHandler(void);
void LVD_LVD2_IRQHandler(void);
void CGC_MOSC_STOP_IRQHandler(void);
void LPM_SNOOZE_REQUEST_IRQHandler(void);
void AGT0_INT_IRQHandler(void);
void AGT0_COMPARE_A_IRQHandler(void);
void AGT0_COMPARE_B_IRQHandler(void);
void AGT1_INT_IRQHandler(void);
void AGT1_COMPARE_A_IRQHandler(void);
void AGT1_COMPARE_B_IRQHandler(void);
void IWDT_UNDERFLOW_IRQHandler(void);
void WDT_UNDERFLOW_IRQHandler(void);
void RTC_ALARM_IRQHandler(void);
void RTC_PERIOD_IRQHandler(void);
void RTC_CARRY_IRQHandler(void);
void ADC0_SCAN_END_IRQHandler(void);
void ADC0_SCAN_END_B_IRQHandler(void);
void ADC0_WINDOW_A_IRQHandler(void);
void ADC0_WINDOW_B_IRQHandler(void);
void ADC0_COMPARE_MATCH_IRQHandler(void);
void ADC0_COMPARE_MISMATCH_IRQHandler(void);
void ADC1_SCAN_END_IRQHandler(void);
void ADC1_SCAN_END_B_IRQHandler(void);
void ADC1_WINDOW_A_IRQHandler(void);
void ADC1_WINDOW_B_IRQHandler(void);
void ADC1_COMPARE_MATCH_IRQHandler(void);
void ADC1_COMPARE_MISMATCH_IRQHandler(void);
void ACMPHS0_INT_IRQHandler(void);
void ACMPHS1_INT_IRQHandler(void);
void ACMPHS2_INT_IRQHandler(void);
void ACMPHS3_INT_IRQHandler(void);
void ACMPHS4_INT_IRQHandler(void);
void ACMPHS5_INT_IRQHandler(void);
void USBFS_FIFO_0_IRQHandler(void);
void USBFS_FIFO_1_IRQHandler(void);
void USBFS_INT_IRQHandler(void);
void USBFS_RESUME_IRQHandler(void);
void IIC0_RXI_IRQHandler(void);
void IIC0_TXI_IRQHandler(void);
void IIC0_TEI_IRQHandler(void);
void IIC0_ERI_IRQHandler(void);
void IIC0_WUI_IRQHandler(void);
void IIC1_RXI_IRQHandler(void);
void IIC1_TXI_IRQHandler(void);
void IIC1_TEI_IRQHandler(void);
void IIC1_ERI_IRQHandler(void);
void IIC2_RXI_IRQHandler(void);
void IIC2_TXI_IRQHandler(void);
void IIC2_TEI_IRQHandler(void);
void IIC2_ERI_IRQHandler(void);
void SSI0_TXI_IRQHandler(void);
void SSI0_RXI_IRQHandler(void);
void SSI0_INT_IRQHandler(void);
void SSI1_TXI_RXI_IRQHandler(void);
void SSI1_INT_IRQHandler(void);
void SRC_INPUT_FIFO_EMPTY_IRQHandler(void);
void SRC_OUTPUT_FIFO_FULL_IRQHandler(void);
void SRC_OUTPUT_FIFO_OVERFLOW_IRQHandler(void);
void SRC_OUTPUT_FIFO_UNDERFLOW_IRQHandler(void);
void SRC_CONVERSION_END_IRQHandler(void);
void PDC_RECEIVE_DATA_READY_IRQHandler(void);
void PDC_FRAME_END_IRQHandler(void);
void PDC_INT_IRQHandler(void);
void CTSU_WRITE_IRQHandler(void);
void CTSU_READ_IRQHandler(void);
void CTSU_END_IRQHandler(void);
void KEY_INT_IRQHandler(void);
void DOC_INT_IRQHandler(void);
void CAC_FREQUENCY_ERROR_IRQHandler(void);
void CAC_MEASUREMENT_END_IRQHandler(void);
void CAC_OVERFLOW_IRQHandler(void);
void CAN0_ERROR_IRQHandler(void);
void CAN0_FIFO_RX_IRQHandler(void);
void CAN0_FIFO_TX_IRQHandler(void);
void CAN0_MAILBOX_RX_IRQHandler(void);
void CAN0_MAILBOX_TX_IRQHandler(void);
void CAN1_ERROR_IRQHandler(void);
void CAN1_FIFO_RX_IRQHandler(void);
void CAN1_FIFO_TX_IRQHandler(void);
void CAN1_MAILBOX_RX_IRQHandler(void);
void CAN1_MAILBOX_TX_IRQHandler(void);
void IOPORT_EVENT_1_IRQHandler(void);
void IOPORT_EVENT_2_IRQHandler(void);
void IOPORT_EVENT_3_IRQHandler(void);
void IOPORT_EVENT_4_IRQHandler(void);
void ELC_SOFTWARE_EVENT_0_IRQHandler(void);
void ELC_SOFTWARE_EVENT_1_IRQHandler(void);
void POEG0_EVENT_IRQHandler(void);
void POEG1_EVENT_IRQHandler(void);
void POEG2_EVENT_IRQHandler(void);
void POEG3_EVENT_IRQHandler(void);
void GPT0_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT0_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT0_COMPARE_C_IRQHandler(void);
void GPT0_COMPARE_D_IRQHandler(void);
void GPT0_COMPARE_E_IRQHandler(void);
void GPT0_COMPARE_F_IRQHandler(void);
void GPT0_COUNTER_OVERFLOW_IRQHandler(void);
void GPT0_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT0_AD_TRIG_A_IRQHandler(void);
void GPT0_AD_TRIG_B_IRQHandler(void);
void GPT1_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT1_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT1_COMPARE_C_IRQHandler(void);
void GPT1_COMPARE_D_IRQHandler(void);
void GPT1_COMPARE_E_IRQHandler(void);
void GPT1_COMPARE_F_IRQHandler(void);
void GPT1_COUNTER_OVERFLOW_IRQHandler(void);
void GPT1_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT1_AD_TRIG_A_IRQHandler(void);
void GPT1_AD_TRIG_B_IRQHandler(void);
void GPT2_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT2_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT2_COMPARE_C_IRQHandler(void);
void GPT2_COMPARE_D_IRQHandler(void);
void GPT2_COMPARE_E_IRQHandler(void);
void GPT2_COMPARE_F_IRQHandler(void);
void GPT2_COUNTER_OVERFLOW_IRQHandler(void);
void GPT2_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT2_AD_TRIG_A_IRQHandler(void);
void GPT2_AD_TRIG_B_IRQHandler(void);
void GPT3_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT3_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT3_COMPARE_C_IRQHandler(void);
void GPT3_COMPARE_D_IRQHandler(void);
void GPT3_COMPARE_E_IRQHandler(void);
void GPT3_COMPARE_F_IRQHandler(void);
void GPT3_COUNTER_OVERFLOW_IRQHandler(void);
void GPT3_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT3_AD_TRIG_A_IRQHandler(void);
void GPT3_AD_TRIG_B_IRQHandler(void);
void GPT4_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT4_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT4_COMPARE_C_IRQHandler(void);
void GPT4_COMPARE_D_IRQHandler(void);
void GPT4_COMPARE_E_IRQHandler(void);
void GPT4_COMPARE_F_IRQHandler(void);
void GPT4_COUNTER_OVERFLOW_IRQHandler(void);
void GPT4_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT4_AD_TRIG_A_IRQHandler(void);
void GPT4_AD_TRIG_B_IRQHandler(void);
void GPT5_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT5_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT5_COMPARE_C_IRQHandler(void);
void GPT5_COMPARE_D_IRQHandler(void);
void GPT5_COMPARE_E_IRQHandler(void);
void GPT5_COMPARE_F_IRQHandler(void);
void GPT5_COUNTER_OVERFLOW_IRQHandler(void);
void GPT5_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT5_AD_TRIG_A_IRQHandler(void);
void GPT5_AD_TRIG_B_IRQHandler(void);
void GPT6_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT6_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT6_COMPARE_C_IRQHandler(void);
void GPT6_COMPARE_D_IRQHandler(void);
void GPT6_COMPARE_E_IRQHandler(void);
void GPT6_COMPARE_F_IRQHandler(void);
void GPT6_COUNTER_OVERFLOW_IRQHandler(void);
void GPT6_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT6_AD_TRIG_A_IRQHandler(void);
void GPT6_AD_TRIG_B_IRQHandler(void);
void GPT7_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT7_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT7_COMPARE_C_IRQHandler(void);
void GPT7_COMPARE_D_IRQHandler(void);
void GPT7_COMPARE_E_IRQHandler(void);
void GPT7_COMPARE_F_IRQHandler(void);
void GPT7_COUNTER_OVERFLOW_IRQHandler(void);
void GPT7_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT7_AD_TRIG_A_IRQHandler(void);
void GPT7_AD_TRIG_B_IRQHandler(void);
void GPT8_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT8_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT8_COMPARE_C_IRQHandler(void);
void GPT8_COMPARE_D_IRQHandler(void);
void GPT8_COMPARE_E_IRQHandler(void);
void GPT8_COMPARE_F_IRQHandler(void);
void GPT8_COUNTER_OVERFLOW_IRQHandler(void);
void GPT8_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT9_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT9_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT9_COMPARE_C_IRQHandler(void);
void GPT9_COMPARE_D_IRQHandler(void);
void GPT9_COMPARE_E_IRQHandler(void);
void GPT9_COMPARE_F_IRQHandler(void);
void GPT9_COUNTER_OVERFLOW_IRQHandler(void);
void GPT9_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT10_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT10_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT10_COMPARE_C_IRQHandler(void);
void GPT10_COMPARE_D_IRQHandler(void);
void GPT10_COMPARE_E_IRQHandler(void);
void GPT10_COMPARE_F_IRQHandler(void);
void GPT10_COUNTER_OVERFLOW_IRQHandler(void);
void GPT10_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT11_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT11_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT11_COMPARE_C_IRQHandler(void);
void GPT11_COMPARE_D_IRQHandler(void);
void GPT11_COMPARE_E_IRQHandler(void);
void GPT11_COMPARE_F_IRQHandler(void);
void GPT11_COUNTER_OVERFLOW_IRQHandler(void);
void GPT11_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT12_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT12_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT12_COMPARE_C_IRQHandler(void);
void GPT12_COMPARE_D_IRQHandler(void);
void GPT12_COMPARE_E_IRQHandler(void);
void GPT12_COMPARE_F_IRQHandler(void);
void GPT12_COUNTER_OVERFLOW_IRQHandler(void);
void GPT12_COUNTER_UNDERFLOW_IRQHandler(void);
void GPT13_CAPTURE_COMPARE_A_IRQHandler(void);
void GPT13_CAPTURE_COMPARE_B_IRQHandler(void);
void GPT13_COMPARE_C_IRQHandler(void);
void GPT13_COMPARE_D_IRQHandler(void);
void GPT13_COMPARE_E_IRQHandler(void);
void GPT13_COMPARE_F_IRQHandler(void);
void GPT13_COUNTER_OVERFLOW_IRQHandler(void);
void GPT13_COUNTER_UNDERFLOW_IRQHandler(void);
void OPS_UVW_EDGE_IRQHandler(void);
void EPTPC_IPLS_IRQHandler(void);
void EPTPC_MINT_IRQHandler(void);
void EPTPC_PINT_IRQHandler(void);
void EDMAC0_EINT_IRQHandler(void);
void EPTPC_TIMER0_RISE_IRQHandler(void);
void EPTPC_TIMER1_RISE_IRQHandler(void);
void EPTPC_TIMER2_RISE_IRQHandler(void);
void EPTPC_TIMER3_RISE_IRQHandler(void);
void EPTPC_TIMER4_RISE_IRQHandler(void);
void EPTPC_TIMER5_RISE_IRQHandler(void);
void EPTPC_TIMER0_FALL_IRQHandler(void);
void EPTPC_TIMER1_FALL_IRQHandler(void);
void EPTPC_TIMER2_FALL_IRQHandler(void);
void EPTPC_TIMER3_FALL_IRQHandler(void);
void EPTPC_TIMER4_FALL_IRQHandler(void);
void EPTPC_TIMER5_FALL_IRQHandler(void);
void USBHS_FIFO_0_IRQHandler(void);
void USBHS_FIFO_1_IRQHandler(void);
void USBHS_USB_INT_RESUME_IRQHandler(void);
void SCI0_RXI_IRQHandler(void);
void SCI0_TXI_IRQHandler(void);
void SCI0_TEI_IRQHandler(void);
void SCI0_ERI_IRQHandler(void);
void SCI0_AM_IRQHandler(void);
void SCI0_RXI_OR_ERI_IRQHandler(void);
void SCI1_RXI_IRQHandler(void);
void SCI1_TXI_IRQHandler(void);
void SCI1_TEI_IRQHandler(void);
void SCI1_ERI_IRQHandler(void);
void SCI1_AM_IRQHandler(void);
void SCI2_RXI_IRQHandler(void);
void SCI2_TXI_IRQHandler(void);
void SCI2_TEI_IRQHandler(void);
void SCI2_ERI_IRQHandler(void);
void SCI2_AM_IRQHandler(void);
void SCI3_RXI_IRQHandler(void);
void SCI3_TXI_IRQHandler(void);
void SCI3_TEI_IRQHandler(void);
void SCI3_ERI_IRQHandler(void);
void SCI3_AM_IRQHandler(void);
void SCI4_RXI_IRQHandler(void);
void SCI4_TXI_IRQHandler(void);
void SCI4_TEI_IRQHandler(void);
void SCI4_ERI_IRQHandler(void);
void SCI4_AM_IRQHandler(void);
void SCI5_RXI_IRQHandler(void);
void SCI5_TXI_IRQHandler(void);
void SCI5_TEI_IRQHandler(void);
void SCI5_ERI_IRQHandler(void);
void SCI5_AM_IRQHandler(void);
void SCI6_RXI_IRQHandler(void);
void SCI6_TXI_IRQHandler(void);
void SCI6_TEI_IRQHandler(void);
void SCI6_ERI_IRQHandler(void);
void SCI6_AM_IRQHandler(void);
void SCI7_RXI_IRQHandler(void);
void SCI7_TXI_IRQHandler(void);
void SCI7_TEI_IRQHandler(void);
void SCI7_ERI_IRQHandler(void);
void SCI7_AM_IRQHandler(void);
void SCI8_RXI_IRQHandler(void);
void SCI8_TXI_IRQHandler(void);
void SCI8_TEI_IRQHandler(void);
void SCI8_ERI_IRQHandler(void);
void SCI8_AM_IRQHandler(void);
void SCI9_RXI_IRQHandler(void);
void SCI9_TXI_IRQHandler(void);
void SCI9_TEI_IRQHandler(void);
void SCI9_ERI_IRQHandler(void);
void SCI9_AM_IRQHandler(void);
void SPI0_RXI_IRQHandler(void);
void SPI0_TXI_IRQHandler(void);
void SPI0_IDLE_IRQHandler(void);
void SPI0_ERI_IRQHandler(void);
void SPI0_TEI_IRQHandler(void);
void SPI1_RXI_IRQHandler(void);
void SPI1_TXI_IRQHandler(void);
void SPI1_IDLE_IRQHandler(void);
void SPI1_ERI_IRQHandler(void);
void SPI1_TEI_IRQHandler(void);
void QSPI_INT_IRQHandler(void);
void SDHIMMC0_ACCS_IRQHandler(void);
void SDHIMMC0_SDIO_IRQHandler(void);
void SDHIMMC0_CARD_IRQHandler(void);
void SDHIMMC0_DMA_REQ_IRQHandler(void);
void SDHIMMC1_ACCS_IRQHandler(void);
void SDHIMMC1_SDIO_IRQHandler(void);
void SDHIMMC1_CARD_IRQHandler(void);
void SDHIMMC1_DMA_REQ_IRQHandler(void);
void SCE_PROC_BUSY_IRQHandler(void);
void SCE_ROMOK_IRQHandler(void);
void SCE_LONG_PLG_IRQHandler(void);
void SCE_TEST_BUSY_IRQHandler(void);
void SCE_WRRDY_0_IRQHandler(void);
void SCE_WRRDY_1_IRQHandler(void);
void SCE_WRRDY_4_IRQHandler(void);
void SCE_RDRDY_0_IRQHandler(void);
void SCE_RDRDY_1_IRQHandler(void);
void SCE_INTEGRATE_WRRDY_IRQHandler(void);
void SCE_INTEGRATE_RDRDY_IRQHandler(void);
void GLCDC_LINE_DETECT_IRQHandler(void);
void GLCDC_UNDERFLOW_1_IRQHandler(void);
void GLCDC_UNDERFLOW_2_IRQHandler(void);
void DRW_INT_IRQHandler(void);
void JPEG_JEDI_IRQHandler(void);
void JPEG_JDTI_IRQHandler(void);

